In [3]:
#Menggabungkan (Merge) Dua Pandas Data Frame
#LeonyCornelia-2373002

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

In [7]:
#Persiapan Data Frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows, n_cols)), 
                  columns = cols)
df

    A   B   C   D   E
0   8   1  14  18  11
1   5  11   4   9   8
2  19  15  13   3  15
3   6  10   1  19  11
4  13   4   1   7   4

In [9]:
df1 = df.copy(deep = True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0   8   1  14  18  11
2  19  15  13   3  15
3   6  10   1  19  11

In [11]:
df2 = df.copy(deep = True)
df2 = df2.drop([0, 3])
df2

    A   B   C  D   E
1   5  11   4  9   8
2  19  15  13  3  15
4  13   4   1  7   4

In [13]:
#Menggabungkan Dua Data Frame
df_inner = pd.merge(df1, df2, how = 'inner')
df_inner

    A   B   C  D   E
0  19  15  13  3  15

In [15]:
df_outer = pd.merge(df1, df2, how = 'outer')
df_outer

    A   B   C   D   E
0   8   1  14  18  11
1  19  15  13   3  15
2   6  10   1  19  11
3   5  11   4   9   8
4  13   4   1   7   4